In [1]:
from sqlalchemy import create_engine

%load_ext sql

drivername = "postgresql"
username = "postgres"
password = "postgres"
host = "localhost"
port = "5432"
database = "analysis"

db_url = f"{drivername}://{username}:{password}@{host}/{database}"
engine = create_engine(db_url)

%sql engine

```sql
%%sql

CREATE TABLE char_data_types (
    char_column char(10),
    varchar_column varchar(10),
    text_column text
);
```

```sql
%%sql
INSERT INTO char_data_types
VALUES
    ('abc', 'abc', 'abc'),
    ('defghi', 'defghi', 'defghi');
```

In [2]:
%%sql
select * from char_data_types

Running query in 'postgresql://postgres:***@localhost/analysis'

2 rows affected.

+-------------+----------------+-------------+
| char_column | varchar_column | text_column |
+-------------+----------------+-------------+
|  abc        |      abc       |     abc     |
|  defghi     |     defghi     |    defghi   |
+-------------+----------------+-------------+

In [3]:
%%sql

COPY char_data_types TO '/tmp/typetest.txt'
WITH (FORMAT CSV, HEADER, DELIMITER '|');

Running query in 'postgresql://postgres:***@localhost/analysis'

2 rows affected.

++
||
++
++

```sql

%%sql
CREATE TABLE number_data_types (
    numeric_column numeric(20,5),
    real_column real,
    double_column double precision
);
```

```sql

%%sql
INSERT INTO number_data_types
VALUES
    (.7, .7, .7),
    (2.13579, 2.13579, 2.13579),
    (2.1357987654, 2.1357987654, 2.1357987654);
```

In [4]:
%%sql
SELECT * FROM number_data_types;

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+----------------+-------------+---------------+
| numeric_column | real_column | double_column |
+----------------+-------------+---------------+
|    0.70000     |     0.7     |      0.7      |
|    2.13579     |   2.13579   |    2.13579    |
|    2.13580     |  2.1357987  |  2.1357987654 |
+----------------+-------------+---------------+

In [5]:
%%sql
SELECT
    numeric_column * 10000000 AS fixed,
    real_column * 10000000 AS floating
FROM
    number_data_types
WHERE
    numeric_column = .7;

Running query in 'postgresql://postgres:***@localhost/analysis'

1 rows affected.

+---------------+------------------+
|     fixed     |     floating     |
+---------------+------------------+
| 7000000.00000 | 6999999.88079071 |
+---------------+------------------+

In [6]:
%%sql
select now();

Running query in 'postgresql://postgres:***@localhost/analysis'

1 rows affected.

+----------------------------------+
|               now                |
+----------------------------------+
| 2024-03-18 03:02:18.557005+00:00 |
+----------------------------------+

```sql
%%sql
CREATE TABLE date_time_types (
    timestamp_column timestamp with time zone,
    interval_column interval
);
```

```sql
%%sql
INSERT INTO date_time_types
VALUES
    ('2022-12-31 01:00 EST','2 days'),
    ('2022-12-31 01:00 -8','1 month'),
    ('2022-12-31 01:00 Australia/Melbourne','1 century'),
    (now(),'1 week');
```

In [7]:
%%sql
select * from date_time_types;

Running query in 'postgresql://postgres:***@localhost/analysis'

4 rows affected.

+----------------------------------+---------------------+
|         timestamp_column         |   interval_column   |
+----------------------------------+---------------------+
|    2022-12-31 06:00:00+00:00     |   2 days, 0:00:00   |
|    2022-12-31 09:00:00+00:00     |   30 days, 0:00:00  |
|    2022-12-30 14:00:00+00:00     | 36500 days, 0:00:00 |
| 2024-03-15 23:23:55.179388+00:00 |   7 days, 0:00:00   |
+----------------------------------+---------------------+

In [8]:
%%sql
SELECT
    timestamp_column,
    interval_column,
    timestamp_column - interval_column AS new_date
FROM date_time_types;

Running query in 'postgresql://postgres:***@localhost/analysis'

4 rows affected.

+----------------------------------+---------------------+----------------------------------+
|         timestamp_column         |   interval_column   |             new_date             |
+----------------------------------+---------------------+----------------------------------+
|    2022-12-31 06:00:00+00:00     |   2 days, 0:00:00   |    2022-12-29 06:00:00+00:00     |
|    2022-12-31 09:00:00+00:00     |   30 days, 0:00:00  |    2022-11-30 09:00:00+00:00     |
|    2022-12-30 14:00:00+00:00     | 36500 days, 0:00:00 |    1922-12-30 14:00:00+00:00     |
| 2024-03-15 23:23:55.179388+00:00 |   7 days, 0:00:00   | 2024-03-08 23:23:55.179388+00:00 |
+----------------------------------+---------------------+----------------------------------+

In [9]:
%%sql
SELECT timestamp_column, CAST(timestamp_column AS varchar(10))
FROM date_time_types;

Running query in 'postgresql://postgres:***@localhost/analysis'

4 rows affected.

+----------------------------------+--------------------+
|         timestamp_column         | timestamp_column_1 |
+----------------------------------+--------------------+
|    2022-12-31 06:00:00+00:00     |     2022-12-31     |
|    2022-12-31 09:00:00+00:00     |     2022-12-31     |
|    2022-12-30 14:00:00+00:00     |     2022-12-30     |
| 2024-03-15 23:23:55.179388+00:00 |     2024-03-15     |
+----------------------------------+--------------------+

In [10]:
%%sql
SELECT timestamp_column, CAST(timestamp_column AS date) as date, cast(timestamp_column as time) as time
FROM date_time_types;

Running query in 'postgresql://postgres:***@localhost/analysis'

4 rows affected.

+----------------------------------+------------+-----------------+
|         timestamp_column         |    date    |       time      |
+----------------------------------+------------+-----------------+
|    2022-12-31 06:00:00+00:00     | 2022-12-31 |     06:00:00    |
|    2022-12-31 09:00:00+00:00     | 2022-12-31 |     09:00:00    |
|    2022-12-30 14:00:00+00:00     | 2022-12-30 |     14:00:00    |
| 2024-03-15 23:23:55.179388+00:00 | 2024-03-15 | 23:23:55.179388 |
+----------------------------------+------------+-----------------+

In [11]:
%%sql
select numeric_column from number_data_types;

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+----------------+
| numeric_column |
+----------------+
|    0.70000     |
|    2.13579     |
|    2.13580     |
+----------------+

In [12]:
%%sql
SELECT numeric_column,
       CAST(numeric_column AS integer),
       CAST(numeric_column AS text)
FROM number_data_types;

Running query in 'postgresql://postgres:***@localhost/analysis'

3 rows affected.

+----------------+------------------+------------------+
| numeric_column | numeric_column_1 | numeric_column_2 |
+----------------+------------------+------------------+
|    0.70000     |        1         |     0.70000      |
|    2.13579     |        2         |     2.13579      |
|    2.13580     |        2         |     2.13580      |
+----------------+------------------+------------------+

In [13]:
%%sql
SELECT timestamp_column::varchar(10)
FROM date_time_types;

Running query in 'postgresql://postgres:***@localhost/analysis'

4 rows affected.

+------------------+
| timestamp_column |
+------------------+
|    2022-12-31    |
|    2022-12-31    |
|    2022-12-30    |
|    2024-03-15    |
+------------------+